In [1]:
import pandas as pd

In [4]:
import numpy as np

In [2]:
pd.__version__

'2.2.2'

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : d9cdd2ee5a58015ef6f4d15c7226110c9aab8140
python                : 3.12.4.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : Intel64 Family 6 Model 142 Stepping 12, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_India.1252

pandas                : 2.2.2
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.9.0.post0
setuptools            : 69.5.1
pip                   : 24.0
Cython                : None
pytest                : 7.4.4
hypothesis            : None
sphinx                : 7.3.7
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : 5.2.1
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : 3.1.4
IPython               : 8.25.0
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
bottleneck            : 1.3.7
dataframe-api-compat  : None
fastparquet           : None
fsspec                : 2024.3.1
gcsfs                 : None
matplotlib            : 3.8.4
numba                 : 0.59.1
numexpr               : 2.8.7
odfpy                 : None
openpyxl              : 3.1.2
pandas_gbq            : None
pyarrow               : 21.0.0
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : 2024.3.1
scipy                 : 1.13.1
sqlalchemy            : 2.0.30
tables                : 3.9.2
tabulate              : 0.9.0
xarray                : 2023.6.0
xlrd                  : None
zstandard             : 0.22.0
tzdata                : 2023.3
qtpy                  : 2.4.1
pyqt5                 : None

In [5]:
data = {
    'animal':['cat','dog','Cat','Snake','Pig','cat','dog','pig'] ,
    'age':[ 2,3.5,np.nan,3,6,1,1.4,np.nan ],
    'Visits' : [ 1,2,4,2,1,3,3,2 ],
    'PRIORITY':['yes','yes','no','yes','no','no','no','yes']
}

label = ['a','b','c','d','e','f','g','h']

In [6]:
pd.DataFrame( data=data )

  animal  age  Visits PRIORITY
0    cat  2.0       1      yes
1    dog  3.5       2      yes
2    Cat  NaN       4       no
3  Snake  3.0       2      yes
4    Pig  6.0       1       no
5    cat  1.0       3       no
6    dog  1.4       3       no
7    pig  NaN       2      yes

In [7]:
df = pd.DataFrame( data=data , index=label )

df.head()

  animal  age  Visits PRIORITY
a    cat  2.0       1      yes
b    dog  3.5       2      yes
c    Cat  NaN       4       no
d  Snake  3.0       2      yes
e    Pig  6.0       1       no

## Rename the columns

In [13]:
df.columns = [ col.trim().lower() for col in df.columns ] 

df.head()

  animal  age  visits priority
a    cat  2.0       1      yes
b    dog  3.5       2      yes
c    Cat  NaN       4       no
d  Snake  3.0       2      yes
e    Pig  6.0       1       no

In [28]:
df['animal'] = df['animal'].apply( lambda x:x.lower() )

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, a to h
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    8 non-null      object
 1   age       6 non-null      float64
 2   visits    8 non-null      int64
 3   priority  8 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [15]:
df.shape

(8, 4)

## select subset of rows and columns

In [17]:
df[ ['animal','age'] ]

  animal  age
a    cat  2.0
b    dog  3.5
c    Cat  NaN
d  Snake  3.0
e    Pig  6.0
f    cat  1.0
g    dog  1.4
h    pig  NaN

In [21]:
df.iloc[ :2 , 1:3 ]

   age  visits
a  2.0       1
b  3.5       2

In [22]:
df.iloc[ : , :2 ]

  animal  age
a    cat  2.0
b    dog  3.5
c    Cat  NaN
d  Snake  3.0
e    Pig  6.0
f    cat  1.0
g    dog  1.4
h    pig  NaN

In [23]:
df[ ['animal','age'] ].iloc[ [2,4,5] ]

  animal  age
c    Cat  NaN
e    Pig  6.0
f    cat  1.0

In [25]:
df[ df['visits'] >= 3 ]

  animal  age  visits priority
c    Cat  NaN       4       no
f    cat  1.0       3       no
g    dog  1.4       3       no

In [29]:
df[ ( df['visits'] >= 3 ) & ( df['animal'] >= 'cat' ) ]

  animal  age  visits priority
c    cat  NaN       4       no
f    cat  1.0       3       no
g    dog  1.4       3       no

In [30]:
df[ df['age'].isna() ]

  animal  age  visits priority
c    cat  NaN       4       no
h    pig  NaN       2      yes

In [50]:
df.loc['f':][["animal",'age']]

  animal  age
f    cat  1.0
g    dog  1.4
h    pig  NaN

In [51]:
df['visits'].sum()

18

In [52]:
df['visits'].mean()

2.25

In [67]:
df.groupby(by='animal')['age'].agg('median').reset_index()

  animal     age
0    cat  2.0000
1    dog  2.4500
2    pig  4.4085
3  snake  3.0000

In [57]:
df['age'] = round(  df['age'].fillna( df['age'].mean() ) , 3 )

In [58]:
df

  animal    age  visits priority
a    cat  2.000       1      yes
b    dog  3.500       2      yes
c    cat  2.817       4       no
d  snake  3.000       2      yes
e    pig  6.000       1       no
f    cat  1.000       3       no
g    dog  1.400       3       no
h    pig  2.817       2      yes